*** [[https://drive.google.com/file/d/1DNPRXQFmRIA0uZNE4ec-JNh1zf6X6mPy/view?usp=sharing][3章1変数]] の一様分布 Unif(min,max)

    - 区間 [min, max] に一様に分布

    - p.d.f
      
      #+begin_src R :session t :results output :exports both

      ( my_dunif <- function (x, min, max) {
        # x はある点 (ベクトルではない)
        1/(max-min)
       })

      1+2

      #+end_src

      #+RESULTS:
      : function (x, min, max) {
      :         # x はある点 (ベクトルではない)
      :         1/(max-min)
      :        }
      : [1] 3

    - ヒストグラム (頻度表)

      Rによる一様分布のヒストグラムの描画

      #+begin_src R :session t :results output :exports both

 # 1~7 の間の乱数列を発生させる
temp <- floor(runif(10^6,1,7))

 # 6区間にヒストグラムを描く
 hist(temp, breaks=c(0,1,2,3,4,5,6), probability=T, col="blue")

       #+end_src

       #+RESULTS:


**** Rの演習
     
     以下，[[https://www1.doshisha.ac.jp/~mjin/R/Chap_10/10.html][データ解析・マイニングとR言語]] R と確率分布を参考にしている
     
     - 二項分布 binom

       #+begin_src R :session t :results output :exports both

dbinom(25,50,0.5) # N=50, p=1/2 k=20の場合の確率
pbinom(20,50,0.5) # N=50, p=1/2, k=0..20の確率の和
pbinom(25,50,0.5) # N=50, p=1/2, k=0..25の確率の和

       #+end_src

       #+RESULTS:
       : [1] 0.1122752
       : [1] 0.1013194
       : [1] 0.5561376

       #+begin_src R :session t :results output :exports both

x <- 0:50

plot(x, dbinom(x,50,prob=0.7), type="h", lwd=5, col="gray")

summary(dbinom(x,50,prob=0.5))
summary(dbinom(x,50,prob=0.3))

       #+end_src

       #+RESULTS:
       :      Min.   1st Qu.    Median      Mean   3rd Qu.      Max. 
       : 0.000e+00 1.000e-08 1.078e-04 1.961e-02 2.152e-02 1.123e-01
       :      Min.   1st Qu.    Median      Mean   3rd Qu.      Max. 
       : 0.000e+00 0.000e+00 2.775e-05 1.961e-02 1.739e-02 1.223e-01

       
